src/cf/DataProcessors/ЗагрузкаТестовMT5.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаТестовMT5</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииТестов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сделки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НаправлениеСделки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОткрытия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтоп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ТипСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипСделки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/НаправлениеСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>НаправлениеСделки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузкаТестовMT5/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Каталог = Объект.Файл;
	ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ФайлНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
		Возврат;
	КонецЕсли;    
	
	Объект.Файл = ДиалогВыбораФайла.ПолноеИмяФайла;
	Элементы.Прочитать.Доступность = Истина;
	
КонецПроцедуры


&НаСервере
Функция  ПрочитатьНаСервере()	
	Объект.Сделки.Очистить();
	
	Чтение = Новый ЧтениеТекста();                                   
	Попытка
		
		Чтение.Открыть(Объект.Файл,КодировкаТекста.UTF8);
		
		Строка = Чтение.ПрочитатьСтроку();
		НаправлениеСделки = Неопределено;
		Пока Не Строка = Неопределено Цикл
			
			МассивЗначений = СтрРазделить(Строка,";",Ложь);
			
			НоваяСтрока = Объект.Сделки.Добавить();
			
			НоваяСтрока.Период =  Дата(ПеревернутьДату(МассивЗначений[0]));
			НоваяСтрока.Инструмент = Справочники.Инструменты.НайтиПоНаименованию(СтрЗаменить(МассивЗначений[1]," ",""));
			Если МассивЗначений[2] <> "Close"  Тогда				
				НаправлениеСделки = МассивЗначений[2];				
				НоваяСтрока.ТипСделки =  Перечисления.ТипСделки.Вход;
			Иначе
				НоваяСтрока.ТипСделки =  Перечисления.ТипСделки.Выход;	
			КонецЕсли;			
			НоваяСтрока.Направление = ?(НаправлениеСделки = "Sell",Перечисления.НаправлениеСделки.Продажа,Перечисления.НаправлениеСделки.Покупка);
			НоваяСтрока.ЦенаОткрытия = МассивЗначений[3];
			НоваяСтрока.ЦенаСтоп	= МассивЗначений[4];
			
			Строка = Чтение.ПрочитатьСтроку();
			
		КонецЦикла; 
		
	Исключение
		
	КонецПопытки;
	
	
	
	
	
	Возврат Истина;
	
КонецФункции


&НаКлиенте
Процедура Прочитать(Команда)
	Если ПустаяСтрока(Объект.Файл) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не задано имя файла!";
		Сообщение.Поле = "Объект.Файл";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	
	ПрочитатьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Прочитать.Доступность = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ФайлПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.Файл) Тогда
		Элементы.Прочитать.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры


Функция ПеревернутьДату(Дата)
         	//дд
Возврат Сред(Дата,9,2)+"."+Сред(Дата,6,2)+"."+Лев(Дата,4)+" "+Прав(Дата,8);	

КонецФункции // ()
